---
title: 尝试做mmd （1/∞）（刚还没完成）
published: 2026-05-23
pinned: false
description: 众所周知：做mmd死路一条……
image: api
tags:
  - mmd
  - 爱好
category: 日常
draft: false
comment: true
updated: 2026-05-24
---
众所周知：做mmd死路一条……但换句话说就是，现在制作方法成熟可靠，轻松易学（然而并非）……其实又不是想靠这个发视频，只是想给自己喜欢的角色制作视频，就不在乎流量什么的了（而且为mmd点赞投币的可以算是真爱粉了吧）。

## 📖 项目由来

在学习了up主[休假度日](https://space.bilibili.com/306173809)的三渲二渲染方法后，就试着用up主的插件创造渲染节点来制作遐蝶的材质（礼服皮肤版本）（其实那天是520来的）。首先要说的是老师讲的很清晰，视频很短但是听完就知道怎么操作。因为老师会在制作时调节一下数值，通过渲染的变化来讲解原理。之前也有看过其他老师的视频讲解得很清晰，但是渲染效果过于基础。当然休假度日老师的效果好有很大一部分原因是老师写的主节点组很好用，但在使用过程也发现老师有些贴图没有完全使用，但是最终呈现的一种无勾线清爽的渲染效果，是一种很好的风格，视频呈现很好看，有种pv感（可能原本老师就想呈现这种效果，只是留下了一些没有用到的贴图）。


## 🚀突破口

老师的教程给我的最大的助力其实是插件的.py文件，是基于blender 高版本写的。又是众所周知，blender每个版本的api和节点都可能不一样，还有mmd_tool这个插件过于老旧（但不知为何最近好像更新了一版），mmd模型和渲染节点往往存在很多兼容性问题（其实主渲染节点组的创建没有成功在5.x运行，产生报错了，老师可能是在4.x写的这个节点组，后续在5.x写了渐变节点组）。基于这个成功的可创建节点组的插件代码，我丢给GPT5.5配合codex去让他详细参考并写一个新的更加接近游戏内的（角色呈现页）渲染效果。结果是到了第五版才终于完成。
原本一开始我就在找官方没有的贴图资源，顺带看看其他老师的渲染主shader，感谢google内置的gemini，一下子理解了我的意思并找到一个解包游戏资源的网站（[AEP](https://assets.escartem.moe/repo)）(里面有原神和崩铁、鸣潮等游戏的解包资源，但是除了前两者外其他的很久没更新，但是资源足够多，好像看到有游戏场景、怪物、特效、语音等资源，为后续给遐蝶加特效埋下伏笔bushi)，和几个热门的仿崩铁渲染的主shader（其中有之前就加了频道的festival）。前几版GPT一直失败，原因是不是各个部位都有lightmap和mask的贴图，GPT没有处理好不同部位的情况。后续他查阅到github上别人分享的崩铁渲染管线以及贴图信息后，终于达到很好的效果，如图：
![](https://img.casto.top/file/posts/mmdcasto1.png)


![](https://img.casto.top/file/posts/mmdcasto2.png)


## 🌟后续目标

- **学习更好的描边方法**，up主[丁不是三分仪](https://space.bilibili.com/354628303)最近的[视频](https://www.bilibili.com/video/BV1waR7BoETA)讲解的新NPR分支更新好像就有
- **逐渐加入特效、场景、动作**，一步步完成一个mmd视频，其实也是完成一次全流程mmd的学习
- **继续完善插件**，特别是自动贴图匹配（前面几次的迭代都没能把贴图匹配好，所以最后是改成放空贴图，然后手动选择）